package Lesson2.Repeat;

public class Repeat {
        /*Класс под названием circle разработан так, что содержит:

Два private переменные экземпляра: radius (типа double) и color (типа String) со значением по умолчанию 1.0 и "red" соответственно.
Два перегруженных конструктора - конструктор по умолчанию без аргумента и конструктор, который принимает аргумент для radius.
Два общедоступных метода: getRadius() - геттер для radius и getArea() - вычисление площади,
которые возвращают радиус и площадь этого экземпляра соответственно.*/
    //radius*radius*Math.PI


    //Пример вывода
    //Круг с радуисом 1.0 имеет площадь 3.141592653589793 (Вызвали конструктор с заранее назначенным радиусом)
    //Круг с радиусом 2.0 имеет площадь 12.566370614359172 (Вызвали конструктор с параметром радуис и сами ввели радиус при
    //создании экземляра)
}
