package Lesson7_Iterator;

public class Tasks {
    /*
    1. Напишите класс Student, предоставляющий информацию об имени студента методом getName()
     и о его курсе методом getCourse(). Напишите метод printStudents(List students, int course),
     который получает список студентов и номер курса и печатает в консоль имена тех студентов из списка,
      которые обучаются на данном курсе. Для обхода списка в этом методе используйте итератор.
    Протестируйте ваш метод (для этого предварительно придется создать объекты класса Student и поместить их в список).


     */
}
