package Lesson4;

public class Praktikum {

    //Напишите программу, которая вставляет определенный элемент в массив
   /*
   Пример:
   1. Есть массив {25, 14, 56, 15, 36, 56, 77, 18, 29, 49}
   2. Вставить элемент 5 на третью позицию (index->2, value->5)
   3. После вставки {25, 14, 5, 56, 15, 36, 56, 77, 18, 29, 49}
    */

    //Напишите программу, которая находит максимальное и минимальное значение в массиве (нельзя использовать встроенный MAX и MIN)
   /*
   Пример:
   1. Есть массив {25, 14, 56, 15, 36, 56, 77, 18, 29, 49}
   2. Вставить элемент 5 на третью позицию (index->2, value->5)
    */

    //Напишите программу, которая выводит количество четных и нечетных чисел в массиве:
    /*
    Пример:
    1. Есть массив {5, 7, 2, 4, 9}
    Количество четных чисел: 2
    Количество нечетных чисел: 3
     */
}
