package Lesson9;

public class Tasks {
    /*
      1. Создайте класс Movie, имплементирующий Comparable<Movie> с тремя private переменными rating, name , year
    Отсортируйте фильмы по годам (не забывайте создать конструктор и геттеры)
    Создайте ArrayList и заполните фильмами
    Выведите фильмы до сортировки и после сортировки.

    2. К прошлому заданию выполните сортировку по имени, рейтингу с помощью Comporator,
     а сортировку по годам оставьте неизменной.

    3. Создать класс Товар, имеющий переменные имя, цена, рейтинг.
    Создать класс Категория, имеющий переменные имя и множество товаров.
     Создать несколько объектов класса Категория.
     Создать метод, распечатывающий товары каталога, отсортированные по имени, цене или рейтингу.
    Используем классы компараторы для каждого вида сортировки.
     */
}
